package org.frank.basic.bitwise;
/*
        位 >> 运算符：左移，右边补 0
        位 << 运算符：右移，左边用 1(有符号) 或 0 补充

 */

public class OperatorDemo2 {
    public static void main(String[] args) {
        System.out.println(5 >> 2); // 1
        System.out.println(5 << 2); // 20
    }
}

/*

    A) 5 >> 2
      00000000 00000000 00000000 00000101
     ------------------------------------
        000000 00000000 00000000 00000001 01

    B) 5 << 2
      00000000 00000000 00000000 00000101
     ------------------------------------
      00000000 00000000 00000000 00010100
 */
