package org.frank.basic.bitwise;
/*
    位^运算符号：针对同一个数据异或两次，其值不变

    面试题：
		请把两个数据进行交换。
		说明：如果我没有指定数据的类型，默认是int类型。
 */

public class OperatorTest {
    public static void main(String[] args) {
        System.out.println(1 ^ 2 ^ 2);  // 1
        System.out.println(1 ^ 1 ^ 2);  // 2
        System.out.println(15 ^ 3 ^ 7 ^ 7 ^ 3); // 15
        /*
        00000000 00000000 00000000 00000001 // 1
       ^00000000 00000000 00000000 00000010 // 2
       ------------------------------------
        00000000 00000000 00000000 00000011 // 3
       ^00000000 00000000 00000000 00000010 // 2
       ------------------------------------
        00000000 00000000 00000000 00000001 // 1
       ^00000000 00000000 00000000 00000001 // 1
       ------------------------------------
        00000000 00000000 00000000 00000000 // 0
       ^00000000 00000000 00000000 00000010 // 2
       ------------------------------------
        00000000 00000000 00000000 00000010 // 2
         */

        // 定义两个变量，如何进行数据交换？
        int a = 10;
        int b = 20;

        System.out.println("a=" + a + ",b=" + b);

        // 方法一：使用第三方变量
//        int temp = a;
//        a = b;
//        b = temp;
//        System.out.println("方法一：a=" + a + ",b=" + b);

        // 方法二：a + b 可能超出int类型范围（4个字节），不建议使用
//        a = a + b;  // a = 30
//        b = a - b;  // b = 10
//        a = a - b;  // a = 20
//        System.out.println("方法二：a=" + a + ",b=" + b);

        // 方法三：同样，a + b 可能超出int类型范围
//        a = (a + b) - (b = a);
//        System.out.println("方法三：a=" + a + ",b=" + b);

        // 方法四：面试（对一个数据异或^两次，其值不变）
        a = a ^ b;
        b = a ^ b;  // 等同于 a ^ b ^ b = a
        a = a ^ b;  // 等同于 a ^ b ^ a = b
        System.out.println("方法四：a=" + a + ",b=" + b);
        // 记忆：左边 a,b,a；右边 a ^ b
    }
}
